Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: إن الله يمسك السماوات والأرض أن تزولا ولئن زالتا إن أمسكهما من أحد من بعده إنه كان حليما غفورا
en: Verily! Allah grasps the heavens and the earth lest they should move away from their places, and if they were to move away from their places, there is not one that could grasp them after Him. Truly, He is Ever Most Forbearing, Oft-Forgiving.

source: وأقسموا بالله جهد أيمانهم لئن جاءهم نذير ليكونن أهدى من إحدى الأمم فلما جاءهم نذير ما زادهم إلا نفورا
en: And they swore by Allah their most binding oath that if a warner came to them, they would be more guided than any of the nations (before them); yet when a warner (Muhammad صلى الله عليه وسلم) came to them, it increased in them nothing but flight (from the truth)

source: استكبارا في الأرض ومكر السيئ ولا يحيق المكر السيئ إلا بأهله فهل ينظرون إلا سنت الأولين فلن تجد لسنت الله تبديلا ولن تجد لسنت الله تحويلا
en: (They took to flight because of their) arrogance in the land and their plotting of evil. But the evil plot encompasses only him who makes it. Then, can they expect anything (else) but the Sunnah (way of dealing) of the peoples of old? So no change will you find in Allah's Sunnah (way of dealing), and no turning off will you find in Allah's Sunnah (way of dealing).

source: أولم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم وكانوا أشد منهم قوة وما كان الله ليعجزه من شيء في السماوات ولا في الأرض إنه كان عليما قديرا
en: Have they not travelled in the land, and seen what was the end of those before them - though they were superior to them in power? Allah is not such that anything in the heavens or in the earth escapes Him. Verily, He is All-Knowing, All-Omnipotent.

source: ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة ولكن يؤخرهم إلى أجل مسمى فإذا جاء أجلهم فإن الله كان بعباده بصيرا
en: And if Allah were to punish men for that which they earned, He would not leave a moving (living) creature on the surface of the earth; but He gives them respite to an appointed term: and when their term comes, then verily, Allah is Ever All-Seer of His slaves.

source: يس
en: Ya-Sin. [These letters are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings].

source: والقرآن الحكيم
en: By the Qur'an, full of wisdom (i.e. full of laws, evidence, and proofs),

source: إنك لمن المرسلين
en: Truly, you (O Muhammad صلى الله عليه وسلم) are one of the Messengers,

source: على صراط مستقيم
en: On the Straight Path (i.e. on Allah's religion of Islamic Monotheism).

source: تنزيل العزيز الرحيم
en: (This is a Revelation) sent down by the All-Mighty, the Most Merciful,

source: لتنذر قوما ما أنذر آباؤهم فهم غافلون
en: In order that you may warn a people whose forefathers were not warned, so they are heedless.

source: لقد حق القول على أكثرهم فهم لا يؤمنون
en: Indeed the Word (of punishment) has proved true against most of them, so they will not believe.

source: إنا جعلنا في أعناقهم أغلالا فهي إلى الأذقان فهم مقمحون
en: Verily We have put on their necks iron collars reaching to the chins, so that their heads are raised up.

source: وجعلنا من بين أيديهم سدا ومن خلفهم سدا فأغشيناهم فهم لا يبصرون
en: And We have put a barrier before them, and a barrier behind them, and We have covered them up, so that they cannot see.

source: وسواء عليهم أأنذرتهم أم لم تنذرهم لا يؤمنون
en: It is the same to them whether you warn them or you warn them not, they will not believe.

source: إنما تنذر من اتبع الذكر وخشي الرحمن بالغيب فبشره بمغفرة وأجر كريم
en: You can only warn him who follows the Reminder (the Qur'an), and fears the Most Gracious (Allah) unseen. Bear you to such one the glad tidings of forgiveness, and a generous reward (i.e. Paradise).

source: إنا نحن نحيي الموتى ونكتب ما قدموا وآثارهم وكل شيء أحصيناه في إمام مبين
en: Verily, We give life to the dead, and We record that which they send before (them), and their traces and all things We have recorded with numbers (as a record) in a Clear Book.

source: واضرب لهم مثلا أصحاب القرية إذ جاءها المرسلون
en: And put forward to them a similitude: the (story of the) dwellers of the town, [it is said that the town was Antioch (Antakiya)], when there came Messengers to them.

source: إذ أرسلنا إليهم اثنين فكذبوهما فعززنا بثالث فقالوا إنا إليكم مرسلون
en: When We sent to them two Messengers, they belied them both; so We reinforced them with a third, and they said: "Verily we have been sent to you as Messengers."

source: قالوا ما أنتم إلا بشر مثلنا وما أنزل الرحمن من شيء إن أنتم إلا تكذبون
en: They (people of the town) said: "You are only human beings like ourselves, and the Most Gracious (Allah) has revealed nothing. You are only telling lies."

source: قالوا ربنا يعلم إنا إليكم لمرسلون
en: The Messengers said: "Our Lord knows that we have been sent as Messengers to you,

source: وما علينا إلا البلاغ المبين
en: "And our duty is only to convey plainly (the Message)."

source: قالوا إنا تطيرنا بكم لئن لم تنتهوا لنرجمنكم وليمسنكم منا عذاب أليم
en: They (people) said: "For us, we see an evil omen from you: if you cease not, we will surely stone you, and a painful torment will touch you from us."

source: قالوا طائركم معكم أئن ذكرتم بل أنتم قوم مسرفون
en: They (Messengers) said: "Your evil omens be with you! (Do you call it "evil omen") because you are admonished? Nay, but you are a people Musrifun (transgressing all bounds by committing all kinds of great sins, and by disobeying Allah).

source: وجاء من أقصى المدينة رجل يسعى قال يا قوم اتبعوا المرسلين
en: And there came a man running from the farthest part of the town. He said: "O my people! Obey the Messengers.

source: اتبعوا من لا يسألكم أجرا وهم مهتدون
en: "Obey those who ask no wages of you (for themselves), and who are rightly guided.

source: وما لي لا أعبد الذي فطرني وإليه ترجعون
en: "And why should I not worship Him (Allah Alone) Who has created me and to Whom you shall be returned.

source: أأتخذ من دونه آلهة إن يردن الرحمن بضر لا تغن عني شفاعتهم شيئا ولا ينقذون
en: "Shall I take besides Him alihah (gods)? If the Most Gracious (Allah) intends me any harm, their intercession will be of no use for me whatsoever, nor can they save me?

source: إني إذا لفي ضلال مبين
en: "Then verily, I should be in plain error.

source: إني آمنت بربكم فاسمعون
en: "Verily! I have believed in your Lord, so listen to me!"

source: قيل ادخل الجنة قال يا ليت قومي يعلمون
en: It was said (to him when the disbelievers killed him): "Enter Paradise." He said: "Would that my people knew

source: بما غفر لي ربي وجعلني من المكرمين
en: "That my Lord (Allah) has forgiven me, and made me of the honoured ones!"

source: وما أنزلنا على قومه من بعده من جند من السماء وما كنا منزلين
en: And We sent not against his people after him a host from the heaven, nor was it needful for Us to send (such a thing).

source: إن كانت إلا صيحة واحدة فإذا هم خامدون
en: It was but one Saihah (shout) and lo! they (all) were still (silent,dead,destroyed).

source: يا حسرة على العباد ما يأتيهم من رسول إلا كانوا به يستهزئون
en: Alas for mankind! There never came a Messenger to them but they used to mock at him.

source: ألم يروا كم أهلكنا قبلهم من القرون أنهم إليهم لا يرجعون
en: Do they not see how many of the generations We have destroyed before them? Verily, they will not return to them.

source: وإن كل لما جميع لدينا محضرون
en: And surely, all - everyone of them will be brought before Us.

source: وآية لهم الأرض الميتة أحييناها وأخرجنا منها حبا فمنه يأكلون
en: And a sign for them is the dead land. We give it life, and We bring forth from it grains, so that they eat thereof.

source: وجعلنا فيها جنات من نخيل وأعناب وفجرنا فيها من العيون
en: And We have made therein gardens of date-palms and grapes, and We have caused springs of water to gush forth therein.

source: ليأكلوا من ثمره وما عملته أيديهم أفلا يشكرون
en: So that they may eat of the fruit thereof - and their hands made it not. Will they not, then, give thanks?

source: سبحان الذي خلق الأزواج كلها مما تنبت الأرض ومن أنفسهم ومما لا يعلمون
en: Glory be to Him Who has created all the pairs of that which the earth produces, as well as of their own (human) kind (male and female), and of that which they know not.

source: وآية لهم الليل نسلخ منه النهار فإذا هم مظلمون
en: And a sign for them is the night. We withdraw therefrom the day, and behold, they are in darkness.

source: والشمس تجري لمستقر لها ذلك تقدير العزيز العليم
en: And the sun runs on its fixed course for a term (appointed). That is the Decree of the All-Mighty, the All-Knowing.

source: والقمر قدرناه منازل حتى عاد كالعرجون القديم
en: And the moon, We have measured for it mansions (to traverse) till it returns like the old dried curved date stalk.

source: لا الشمس ينبغي لها أن تدرك القمر ولا الليل سابق النهار وكل في فلك يسبحون
en: It is not for the sun to overtake the moon, nor does the night outstrip the day. They all float, each in an orbit.

source: وآية لهم أنا حملنا ذريتهم في الفلك المشحون
en: And an Ayah (sign) for them is that We bore their offspring in the laden ship [of Nuh (Noah)].

source: وخلقنا لهم من مثله ما يركبون
en: And We have created for them of the like thereunto, on which they ride.

source: وإن نشأ نغرقهم فلا صريخ لهم ولا هم ينقذون
en: And if We will, We shall drown them, and there will be no shout (or helper) for them (to hear their cry for help), nor will they be saved.

source: إلا رحمة منا ومتاعا إلى حين
en: Unless it be a mercy from Us, and as an enjoyment for a while.

source: وإذا قيل لهم اتقوا ما بين أيديكم وما خلفكم لعلكم ترحمون
en: And when it is said to them: "Fear of that which is before you (worldly torments), and that which is behind you (torments in the Hereafter), in order that you may receive Mercy (i.e. if you believe in Allah's religion - Islamic Monotheism, and avoid polytheism, and obey Allah with righteous deeds)."

source: وإذا قيل لهم أنفقوا مما رزقكم الله قال الذين كفروا للذين آمنوا أنطعم من لو يشاء الله أطعمه إن أنتم إلا في ضلال مبين
en: And when it is said to them: "Spend of that with which Allah has provided you," those who disbelieve say to those who believe: "Shall we feed those whom, if Allah willed, He (Himself) would have fed? You are only in a plain error."

source: ما ينظرون إلا صيحة واحدة تأخذهم وهم يخصمون
en: They await only but a single Saihah (shout), which will seize them while they are disputing!

source: فلا يستطيعون توصية ولا إلى أهلهم يرجعون
en: Then they will not be able to make bequest, nor they will return to their family.

source: ونفخ في الصور فإذا هم من الأجداث إلى ربهم ينسلون
en: And the Trumpet will be blown (i.e. the second blowing) and behold from the graves they will come out quickly to their Lord.

source: قالوا يا ويلنا من بعثنا من مرقدنا هذا ما وعد الرحمن وصدق المرسلون
en: They will say: "Woe to us! Who has raised us up from our place of sleep." (It will be said to them): "This is what the Most Gracious (Allah) had promised, and the Messengers spoke truth!"

source: إن كانت إلا صيحة واحدة فإذا هم جميع لدينا محضرون
en: It will be but a single Saihah (shout), so behold they will all be brought up before Us!

source: فاليوم لا تظلم نفس شيئا ولا تجزون إلا ما كنتم تعملون
en: This Day (Day of Resurrection), none will be wronged in anything, nor will you be requited anything except that which you used to do.

source: إن أصحاب الجنة اليوم في شغل فاكهون
en: Verily, the dwellers of the Paradise, that Day, will be busy with joyful things.

source: هم وأزواجهم في ظلال على الأرائك متكئون
en: They and their wives will be in pleasant shade, reclining on thrones.

source: لهم فيها فاكهة ولهم ما يدعون
en: They will have therein fruits (of all kinds) and all that they ask for.

source: سلام قولا من رب رحيم
en: (It will be said to them): Salam (peace be on you) - a Word from the Lord (Allah), Most Merciful.

source: وامتازوا اليوم أيها المجرمون
en: (It will be said): "And O you Mujrimun (criminals, polytheists, sinners, disbelievers in the Islamic Monotheism, wicked evil ones)! Get you apart this Day (from the believers).

source: ألم أعهد إليكم يا بني آدم أن لا تعبدوا الشيطان إنه لكم عدو مبين
en: Did I not command you, O Children of Adam, that you should not worship Shaitan (Satan). Verily, he is a plain enemy to you.

source: وأن اعبدوني هذا صراط مستقيم
en: And that you should worship Me [Alone - Islamic Monotheism, and set up not rivals, associate-gods with Me]. That is the Straight Path.

source: ولقد أضل منكم جبلا كثيرا أفلم تكونوا تعقلون
en: And indeed he (Satan) did lead astray a great multitude of you. Did you not, then, understand?

source: هذه جهنم التي كنتم توعدون
en: This is Hell which you were promised!

source: اصلوها اليوم بما كنتم تكفرون
en: Burn therein this Day, for that you used to disbelieve.

source: اليوم نختم على أفواههم وتكلمنا أيديهم وتشهد أرجلهم بما كانوا يكسبون
en: This Day, We shall seal up their mouths, and their hands will speak to Us, and their legs will bear witness to what they used to earn. (It is said that one's left thigh will be the first to bear the witness). [Tafsir At-Tabari,]

source: ولو نشاء لطمسنا على أعينهم فاستبقوا الصراط فأنى يبصرون
en: And if it had been Our Will, We would surely have wiped out (blinded) their eyes, so that they would struggle for the Path, how then would they see?

source: ولو نشاء لمسخناهم على مكانتهم فما استطاعوا مضيا ولا يرجعون
en: And if it had been Our Will, We could have transformed them (into animals or lifeless objects) in their places. Then they would have been unable to go forward (move about) nor they could have turned back.

source: ومن نعمره ننكسه في الخلق أفلا يعقلون
en: And he whom We grant long life - We reverse him in creation (weakness after strength). Will they not then understand?

source: وما علمناه الشعر وما ينبغي له إن هو إلا ذكر وقرآن مبين
en: And We have not taught him (Muhammad صلى الله عليه وسلم) poetry, nor is it suitable for him. This is only a Reminder and a plain Qur'an.

source: لينذر من كان حيا ويحق القول على الكافرين
en: That he or it (Muhammad صلى الله عليه وسلم or the Qur'an) may give warning to him who is living (a healthy minded - the believer), and that Word (charge) may be justified against the disbelievers (dead, as they reject the warnings).

source: أولم يروا أنا خلقنا لهم مما عملت أيدينا أنعاما فهم لها مالكون
en: Do they not see that We have created for them of what Our Hands have created the cattle, so that they are their owners.

source: وذللناها لهم فمنها ركوبهم ومنها يأكلون
en: And We have subdued them unto them so that some of them they have for riding and some they eat.

source: ولهم فيها منافع ومشارب أفلا يشكرون
en: And they have (other) benefits from them, and they get (milk) to drink. Will they not then be grateful?

source: واتخذوا من دون الله آلهة لعلهم ينصرون
en: And they have taken besides Allah alihah (gods), hoping that they might be helped (by those so-called gods).

source: لا يستطيعون نصرهم وهم لهم جند محضرون
en: They cannot help them, but they will be brought forward as a troop against those who worshipped them (at the time of Reckoning).

source: فلا يحزنك قولهم إنا نعلم ما يسرون وما يعلنون
en: So let not their speech, then, grieve you (O Muhammad صلى الله عليه وسلم). Verily, We know what they conceal and what they reveal.

source: أولم ير الإنسان أنا خلقناه من نطفة فإذا هو خصيم مبين
en: Does not man see that We have created him from Nutfah (mixed male and female sexual discharge - semen drops). Yet behold he (stands forth) as an open opponent.

source: وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم
en: And he puts forth for Us a parable, and forgets his own creation. He says: "Who will give life to these bones after they are rotten and have become dust?"

source: قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم
en: Say: (O Muhammad صلى الله عليه وسلم) "He will give life to them Who created them for the first time! And He is the All-Knower of every creation!"

source: الذي جعل لكم من الشجر الأخضر نارا فإذا أنتم منه توقدون
en: He Who produces for you fire out of the green tree, when behold you kindle therewith.

source: أوليس الذي خلق السماوات والأرض بقادر على أن يخلق مثلهم بلى وهو الخلاق العليم
en: Is not He Who created the heavens and the earth, Able to create the like of them? Yes, indeed! He is the All-Knowing Supreme Creator.

source: إنما أمره إذا أراد شيئا أن يقول له كن فيكون
en: Verily, His Command, when He intends a thing, is only that He says to it, "Be!" - and it is!

source: فسبحان الذي بيده ملكوت كل شيء وإليه ترجعون
en: So glorified be He and exalted above all that they associate with Him, and in Whose Hands is the dominion of all things: and to Him you shall be returned.

source: والصافات صفا
en: By those (angels) ranged in ranks (or rows).

source: فالزاجرات زجرا
en: By those (angels) who drive the clouds in a good way.

source: فالتاليات ذكرا
en: By those (angels) who bring the Book and the Qur'an from Allah to mankind [Tafsir Ibn Kathir].

source: إن إلهكم لواحد
en: Verily your Ilah (God) is indeed One (i.e. Allah):

source: رب السماوات والأرض وما بينهما ورب المشارق
en: Lord of the heavens and of the earth, and all that is between them, and Lord of every point of the sun's risings.

source: إنا زينا السماء الدنيا بزينة الكواكب
en: Verily We have adorned the near heaven with the stars (for beauty).

source: وحفظا من كل شيطان مارد
en: And to guard against every rebellious devil.

source: لا يسمعون إلى الملإ الأعلى ويقذفون من كل جانب
en: They cannot listen to the higher group (angels) for they are pelted from every side.

source: دحورا ولهم عذاب واصب
en: Outcast, and theirs is a constant (or painful) torment.

source: إلا من خطف الخطفة فأتبعه شهاب ثاقب
en: Except such as snatch away something by stealing, and they are pursued by a flaming fire of piercing brightness.

source: فاستفتهم أهم أشد خلقا أم من خلقنا إنا خلقناهم من طين لازب
en: Then ask them (i.e. these polytheists, O Muhammad صلى الله عليه وسلم): "Are they stronger as creation, or those (others like the heavens and the earth and the mountains) whom We have created?" Verily, We created them of a sticky clay.

source: بل عجبت ويسخرون
en: Nay, you (O Muhammad صلى الله عليه وسلم) wondered (at their insolence) while they mock (at you and at the Qur'an).

source: وإذا ذكروا لا يذكرون
en: And when they are reminded, they pay no attention.

source: وإذا رأوا آية يستسخرون
en: And when they see an Ayah (a sign, or an evidence) from Allah, they mock at it.

source: وقالوا إن هذا إلا سحر مبين
en: And they say: "This is nothing but evident magic!

source: أإذا متنا وكنا ترابا وعظاما أإنا لمبعوثون
en: "When we are dead and have become dust and bones, shall we (then) verily be resurrected?

source: أوآباؤنا الأولون
en: "And also our fathers of old?"

source: قل نعم وأنتم داخرون
en: Say (O Muhammad صلى الله عليه وسلم): "Yes, and you shall then be humiliated."

source: فإنما هي زجرة واحدة فإذا هم ينظرون
en: It will be a single Zajrah [shout (i.e. the second blowing of the Trumpet)], and behold, they will be staring!

source: وقالوا يا ويلنا هذا يوم الدين
en: They will say: "Woe to us! This is the Day of Recompense!"

source: هذا يوم الفصل الذي كنتم به تكذبون
en: (It will be said): "This is the Day of Judgement which you used to deny."

source: احشروا الذين ظلموا وأزواجهم وما كانوا يعبدون
en: (It will be said to the angels): "Assemble those who did wrong, together with their companions (from the devils) and what they used to worship,

source: من دون الله فاهدوهم إلى صراط الجحيم
en: "Instead of Allah, and lead them on to the way of flaming Fire (Hell);

source: وقفوهم إنهم مسئولون
en: "But stop them, verily they are to be questioned.

source: ما لكم لا تناصرون
en: "What is the matter with you? Why do you not help one another (as you used to do in the world)?"

source: بل هم اليوم مستسلمون
en: Nay, but that Day they shall surrender.

source: وأقبل بعضهم على بعض يتساءلون
en: And they will turn to one another and question one another.

source: قالوا إنكم كنتم تأتوننا عن اليمين
en: They will say: "It was you who used to come to us from the right side [i.e. from the right side of one of us and beautify for us every evil, enjoin on us polytheism, and stop us from the truth i.e. Islamic Monotheism and from every good deed]."

source: قالوا بل لم تكونوا مؤمنين
en: They will reply: "Nay, you yourselves were not believers.

source: وما كان لنا عليكم من سلطان بل كنتم قوما طاغين
en: "And we had no authority over you. Nay! But you were Taghun (transgressing) people (polytheists, and disbelievers).

source: فحق علينا قول ربنا إنا لذائقون
en: "So now the Word of our Lord has been justified against us, that we shall certainly (have to) taste (the torment).

source: فأغويناكم إنا كنا غاوين
en: "So we led you astray because we were ourselves astray."

source: فإنهم يومئذ في العذاب مشتركون
en: Then verily, that Day, they will (all) share in the torment.

source: إنا كذلك نفعل بالمجرمين
en: Certainly, that is how We deal with Al-Mujrimun (polytheists, sinners, disbelievers, criminals, the disobedient to Allah).

source: إنهم كانوا إذا قيل لهم لا إله إلا الله يستكبرون
en: Truly, when it was said to them: La ilaha illallah "(none has the right to be worshipped but Allah)," they puffed themselves up with pride (i.e. denied it).

source: ويقولون أئنا لتاركو آلهتنا لشاعر مجنون
en: And (they) said: "Are we going to abandon our alihah (gods) for the sake of a mad poet?"

source: بل جاء بالحق وصدق المرسلين
en: Nay! he (Muhammad صلى الله عليه وسلم) has come with the truth (i.e. Allah's religion - Islamic Monotheism and this Qur'an) and he confirms the Messengers (before him who brought Allah's religion - Islamic Monotheism).

source: إنكم لذائقو العذاب الأليم
en: Verily, you (pagans of Makkah) are going to taste the painful torment;

source: وما تجزون إلا ما كنتم تعملون
en: And you will be requited nothing except for what you used to do (evil deeds, sins, and Allah's disobedience which you used to do in this world)

source: إلا عباد الله المخلصين
en: Save the chosen slaves of Allah (i.e. the true believers of Islamic Monotheism).

source: أولئك لهم رزق معلوم
en: For them there will be a known provision (in Paradise),

source: فواكه وهم مكرمون
en: Fruits; and they shall be honoured,

source: في جنات النعيم
en: In the Gardens of delight (Paradise),

source: على سرر متقابلين
en: Facing one another on thrones.

source: يطاف عليهم بكأس من معين
en: Round them will be passed a cup of pure wine -

source: بيضاء لذة للشاربين
en: White, delicious to the drinkers.

source: لا فيها غول ولا هم عنها ينزفون
en: Neither will they have Ghoul (any kind of hurt, abdominal pain, headache, a sin) from that, nor will they suffer intoxication therefrom.

source: وعندهم قاصرات الطرف عين
en: And beside them will be Qasirat-at-Tarf [chaste females (wives), restraining their glances (desiring none except their husbands)], with wide and beautiful eyes.

source: كأنهن بيض مكنون
en: (Delicate and pure) as if they were (hidden) eggs (well) preserved.

source: فأقبل بعضهم على بعض يتساءلون
en: Then they will turn to one another, mutually questioning.

source: قال قائل منهم إني كان لي قرين
en: A speaker of them will say: "Verily, I had a companion (in the world),

source: يقول أإنك لمن المصدقين
en: Who used to say: "Are you among those who believe (in resurrection after death).

source: أإذا متنا وكنا ترابا وعظاما أإنا لمدينون
en: "(That) when we die and become dust and bones, shall we indeed (be raised up) to receive reward or punishment (according to our deeds)?"

source: قال هل أنتم مطلعون
en: (The speaker) said: "Will you look down?"

source: فاطلع فرآه في سواء الجحيم
en: So he looked down and saw him in the midst of the Fire.

source: قال تالله إن كدت لتردين
en: He said: "By Allah! You have nearly ruined me.

source: ولولا نعمة ربي لكنت من المحضرين
en: "Had it not been for the Grace of my Lord, I would certainly have been among those brought forth (to Hell)."

source: أفما نحن بميتين
en: (The dwellers of Paradise will say) "Are we then not to die (any more)?
